src/Conversion_3_Plus/Catalogs/ПравилаКонвертацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПравилаКонвертацииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АлгоритмПриОтправкеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АлгоритмПередПолучениемДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АлгоритмПриПолученииДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Conversion_3_Plus/Catalogs/ПравилаКонвертацииОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПриОтправке;

&НаКлиенте
Перем КонсольКодаПередПолучениемДанных;

&НаКлиенте
Перем КонсольКодаПриПолученниДанных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.АлгоритмПриОтправкеДанных.Видимость = Ложь;
	Элементы.АлгоритмПередПолучениемДанных.Видимость = Ложь;
	Элементы.АлгоритмПриПолученииДанных.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ПриОтправкеДанныхHTML = АдресКонсолиКода;
	ПередПолучениемДанныхHTML = АдресКонсолиКода;
	ПриПолученииДанныхHTML = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	
	Объект.АлгоритмПриОтправкеДанных = КонсольКодаПриОтправке.getText();
	
	Объект.АлгоритмПередПолучениемДанных = КонсольКодаПередПолучениемДанных.getText();
	
	Объект.АлгоритмПриПолученииДанных = КонсольКодаПриПолученниДанных.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_ПриОтправкеДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПриОтправке = Элементы.ПриОтправкеДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПриОтправке, Объект.АлгоритмПриОтправкеДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередПолучениемДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередПолучениемДанных = Элементы.ПередПолучениемДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПередПолучениемДанных, Объект.АлгоритмПередПолучениемДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриПолученииДанныхHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПриПолученниДанных = Элементы.ПриПолученииДанныхHTML.Документ.defaultView;
	Расш1_КонсольКода.ИнициализацияРедактора(КонсольКодаПриПолученниДанных, Объект.АлгоритмПриПолученииДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_ПриОтправкеДанныхHTMLСветлаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПриОтправкеДанныхHTML");
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОтправкеДанныхHTMLТемнаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПриОтправкеДанныхHTML", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередПолучениемДанныхHTMLСветлаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПередПолучениемДанныхHTML");
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередПолучениемДанныхHTMLТемнаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПередПолучениемДанныхHTML", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриПолученииДанныхHTMLСветлаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПриПолученииДанныхHTML");
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриПолученииДанныхHTMLТемнаяПосле(Команда)
	Расш1_КонсольКода.УстановитьТемуКонсоли(ЭтотОбъект, "ПриПолученииДанныхHTML", Ложь);
КонецПроцедуры

#КонецОбласти
